Revit 2024 API
DirectShapeType.RemoveReferenceObject Method
Overload List
Name | Description
RemoveReferenceObject(String)
 Removes any reference objects with the given name from the DirectShapeType. Nothing is done if no reference objects have the given name or if the name is the empty string.
RemoveReferenceObject(ExternalGeometryId)
 Removes any reference object associated with the provided ExternalGeometryId from the DirectShapeType. Nothing is done if no reference object has the given external ID or if the external ID is an empty string.
See Also
DirectShapeType Class
DirectShapeType Members
Autodesk.Revit.DB Namespace